{
  "id": "NkLO9XxY",
  "nodes": [
    {
      "name": "about-me",
      "url": "about-me",
      "properties": [
        {
          "name": "meta-description",
          "description": "The meta-description must contain the primary keyword / phrase and be no longer than 156 characters",
          "value": "Adam Johnstone is a disruptive tech innovator, entrepreneur and business owner located in Melbourne, Australia. Skills - NodeJS, .NET, C#, SharePoint."
        },
        {
          "name": "page-title",
          "description": "The page title must contain the primary keyword / phrase and be no longer than 70 characters",
          "value": "Adam Johnstone | Disruptive Tech Innovator and Entrepreneur"
        }
      ],
      "contents": [
        {
          "name": "overview",
          "value": "<p>Adam is a disruptive tech innovator, entrepreneur and business owner located in Melbourne, Australia.</p><p>Driven and dedicated (absolutely&nbsp;110%)&nbsp;to bring the latest in tech innovations, software and coding frameworks to entrepreneurs and companies worldwide to help them out innovate, out disrupt and out perform their competition.</p><h2>Why Tech Innovation?</h2><p>During his career, Adam has worked with the top end of town, large private companies as well as relatively small sized businesses - where Adam noticed&nbsp;a common thread between all of them.</p><p>Businesses (in Australia especially) are heavily under-investing in their tech innovation and if they are not careful, could find themselves out business soon if they don't start!</p><p>Adam emphasises that Tech Innovation separates your business from the rest and makes it unique. </p><p>With new technology we can carve out our own playing field and determine our own rules of engagement. Using Tech Innovation&nbsp;we can put our \"peg in the sand\" when it comes to saying...</p><p> \"We are Company A, this is what we do differently than Company B - and here's why\".</p><p>Adam believes that by implementing a process of \"constant innovation\" we keep our business growing because we can adapt to the ever changing landscape. You are either a player (and tech innovator) or you are playing catch up.</p><h2>How do we Get Started?</h2><p>As TedX talker&nbsp;<a class=\"text-link\" href=\"http://www.tailopez.com/\" target=\"_blank\" title=\"Tai Lopez\">Tai Lopez</a>&nbsp;quotes - \"Make war with a multitude of counsellors and allies\".</p><p>Adam brings to the table a deep expertise in apps, software, open source / licensed platforms and the latest tech innovations collected from around the globe.</p><p>Ask him for a \"who's who\" in this space and your likely to get a list of disruptive technologies and people to look out for right now.</p><p>The questions then is - \"If you wish to wage an innovation war against your competition, who do you want in your corner?\"</p><p><a href=\"http://adamjohnstone.co/pages/contact-me\" style=\"background-color: white; line-height: 1.563;\">Talk to Adam now</a></p><h2>Technologies we <u>Stress</u> you should be Using</h2><p>Adam stresses that you should already be using the following technologies as a base for innovation in your business right now.</p><p>If you're not - then you need to (at a high level) understand how they work and why they are important.</p><p>The list is as follows:</p><ul><li><a class=\"text-link\" href=\"https://nodejs.org/\" target=\"_blank\" title=\"NodeJS\"><strong>NodeJS</strong></a> - a server side javascripting framework, non-blocking - used in Silicon Valley extensively</li><li><a class=\"text-link\" href=\"https://angularjs.org/\" target=\"_blank\" title=\"AngularJS\"><strong>Angular 1.x &amp; 2 (beta)</strong></a> - A Web UI framework developed by Google you should use no matter what</li><li><a class=\"text-link\" href=\"https://products.office.com/en-us/sharepoint/sharepoint-2013-overview-collaboration-software-features\" target=\"_blank\" title=\"Microsoft SharePoint\"><strong>Microsoft SharePoint</strong></a> - intranets, extranets, document management and workflows for enterprise</li><li><a class=\"text-link\" href=\"http://ionicframework.com/\" target=\"_blank\" title=\"Ionic Framework\"><strong>Ionic</strong></a> - Build iPhone Apps / iPad Apps / Android Apps - using Angular as its UI framework (did we mention that Google is good??)</li><li><strong><a class=\"text-link\" href=\"https://jquery.com/\" target=\"_blank\" title=\"jQuery\">jQuery</a></strong> - a client side javascript framework to bind javascript events to controls on page - techy stuff - but it makes your website or web application animated, clickable and interactive</li><li><strong><a class=\"text-link\" href=\"www.asp.net/mvc\" target=\"_blank\" title=\"www.asp.net/mvc\">Microsoft ASP.NET, MVC, C#</a></strong> - server side code frameworks to build enterprise applications on, where your code and IP can be compiled so that others have difficulty in copying or replicating your ideas and frameworks</li></ul><p>Adam uses, implements and is across the strategic advantages the above tech innovations provide. </p><p>If your not across this list - then you need to get started now... nuff said!</p><h2>Adam's Background&nbsp;</h2><p>Adam&nbsp;started coding&nbsp;when he was 13 years old, after reading a series of Visual Basic 3.0 books cover-to-cover on a family holiday.</p><p>In high school he helped teach the programming classes and continued programming studies at Monash University Caulfield where he developed a deep passion for the industry.</p><p>Adam worked for large IT consultancies before niching down into specific technology platforms to get a better understanding of all of the available products and coding frameworks available to startups, small businesses and enterprises alike.</p><p>What he realised is that in most cases, people are making decisions with less than half the picture in front of them and they are definetely not talking to the right people who will give an unbiased and straight down the line opinion.</p><p>Adam wanted the tone and feel of this website to resemble how Adam communicates. A no bullshit approach to tech innovation and to hold nothing back in the process.</p><p>If you don't like that kind of opinion - then Adam is not for you.</p><h2>Adam's Manifesto</h2><p>Adam believes and supports Eric Ries' manifesto (outlined in the bestselling book <a href=\"http://www.amazon.com/The-Lean-Startup-Entrepreneurs-Continuous/dp/0307887898\" rel=\"nofollow\" target=\"_blank\">The Lean Startup</a>) that states all innovation must go through a \"<strong>Build, Measure, Learn</strong>\" loop.</p><p>Adam adds his own advice to this approach, being a further first step of \"Select\".</p><p>In other words - you carefully need to select the best idea / platform / technology stack <strong>before</strong> moving into the build, measure and learn loop.</p><p>Failure to do so injects a lot of wasted time and energy itself - which is exactly what we are trying to eliminate in the first place. </p><p>Please read <a href=\"http://www.amazon.com/The-Lean-Startup-Entrepreneurs-Continuous/dp/0307887898\" rel=\"nofollow\" target=\"_blank\">The Lean Startup</a> to become more familiar with this approach and to undersand why Adam believes this manifesto is vital in this day and age to compete on a global level.</p><p>Looking to innovate or disrupt a tired industry?</p>"
        }
      ]
    }
  ]
}